{
    "//": " Copyright © 2024 Dell Inc. or its subsidiaries",

    "//" : "Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”),to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so",

    "//": "THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE",

    "//": "The example parameter values provided in the 'entra' block must be updated by the user accordingly.",

    "//": "The following lines proceeded with // are the instructions on how to update the corresponding values in the entra block",
    "//saml_endpoint": "Add the tenant_id from your Azure Entra",
    "//login_endpoint": "Do not change",
    "//username": "Username in Azure Entra",
    "//password": "Password in Azure Entra",
    "//saml_pipe": "Change the path to a local directory on your machine where you want to save the saml token, end with '/samlPipe' and create a file with name 'samlPipe'",
    "//assertion_consumer_service_url": "Should get from the Dell Premier Federation configuration example: https://idhub.dell.com/sp/ACS.saml2",
    "//entra_app_client_secret": "Is the client secret for the App you created for Apex in Azure Entra",
    "entra": {
        "saml_endpoint": "https://login.microsoftonline.com/{tenant_id}/saml2",
        "login_endpoint": "https://entra.microsoft.com/",
        "username": "{username}",
        "password": "{password}",
        "saml_pipe": "/tmp/samlPipe",
        "assertion_consumer_service_url": "{assertion_consumer_service_url}",
        "entra_app_client_secret": "{entra_app_client_secret}"
    }
}